app/Controllers/Controllermasyarakat.php

SELECT *
FROM `tanggapan`
JOIN `pengaduan` ON `pengaduan`.`id_pengaduan`=`tanggapan`.`id_pengaduan`
JOIN `masyarakat` ON `masyarakat`.`nik`=`pengaduan`.`nik`
JOIN `petugas` ON `petugas`.`id_petugas`=`tanggapan`.`id_petugas`
WHERE `nama` = 'Nova Fitriani'
---
public function laporan()
{
	$n = session()->get('nama');
	$this->tanggapan->join('pengaduan', 'pengaduan.id_pengaduan=tanggapan.id_pengaduan');
	$this->tanggapan->join('masyarakat', 'masyarakat.nik=pengaduan.nik');
	$this->tanggapan->join('petugas', 'petugas.id_petugas=tanggapan.id_petugas');
	$data['ListPengaduan'] = $this->tanggapan->where('nama', $n)->findAll();

SELECT *
FROM `petugas`
WHERE `username` = 'risma'
AND `password` = '202cb962ac59075b964b07152d234b70'
SELECT *
FROM `masyarakat`
WHERE `username` = 'risma'
AND `password` = '202cb962ac59075b964b07152d234b70'
---
	public function login(){
		helper(['form']);
		$aturan=['txtUsername'=>'required', 'txtPassword'=>'required'];
		if($this->validate($aturan)){
			$syarat = [ 'username'=> $this->request->getPost('txtUsername'),'password'=> md5($this->request->getPost('txtPassword'))];
			$Userpetugas = $this->petugas->where($syarat) ->find();
		$Usermasyarakat = $this->masyarakat->where($syarat) ->find();

SELECT *
FROM `pengaduan`
JOIN `masyarakat` ON `masyarakat`.`nik`=`pengaduan`.`nik`
JOIN `tanggapan` ON `tanggapan`.`id_pengaduan`=`pengaduan`.`id_pengaduan`
WHERE `nama` = 'Nova Fitriani'
---
	public function pengaduan()
	{
		if(!session()->get('sudahkahLogin')){
			return redirect()->to('/');
			exit;
			}
		if (!$this->validate([]))
        {
			$n = session()->get('nama');
            $data['validation'] = $this->validator;
            $data['uploads'] = $this->model_upload->get_uploads();
			$this->pengaduan->join('masyarakat','masyarakat.nik=pengaduan.nik');
			$this->pengaduan->join('tanggapan','tanggapan.id_pengaduan=pengaduan.id_pengaduan');
			$data['listPengaduan'] = $this->pengaduan-> where('nama', $n)->findAll();